Repository: django-oauth/django-oauth-toolkit
Catalog: oauth2_provider/locale/*/LC_MESSAGES/django.po
Languages: tr, zh_hans

source: Confidential
tr: Gizli
zh_hans: 内部应用

source: Public
tr: Herkese açık
zh_hans: 开放应用

source: Authorization code
tr: Yetkilendirme kodu
zh_hans: 授权码模式

source: Device Code
tr: Cihaz Kodu

source: Implicit
tr: Açık
zh_hans: 简化模式

source: Resource owner password-based
tr: Kaynak sahibi şifre tabanlı
zh_hans: 密码模式

source: Client credentials
tr: İstemci kimlik bilgileri
zh_hans: 客户端模式

source: OpenID connect hybrid
tr: OpenID connect hibrit

source: No OIDC support
tr: OpenID Connect desteği yok

source: RSA with SHA-2 256
tr: RSA ile SHA-2 256

source: HMAC with SHA-2 256
tr: HMAC ile SHA-2 256

source: Allowed URIs list, space separated
tr: İzin verilen URI'ler listesi, boşlukla ayrılmış
zh_hans: 允许的 Uri 列表，空格分隔

source: Allowed Post Logout URIs list, space separated
tr: İzin verilen Oturum Kapatma URI'leri listesi, boşlukla ayrılmış

source: Client secret for authentication
tr: Kimlik doğrulama için istemci gizli anahtarı

source: Allowed origins list to enable CORS, space separated
tr: CORS'u etkinleştirmek için izin verilen kökenler listesi, boşlukla ayrılmış

source: redirect_uris cannot be empty with grant_type {grant_type}
tr: redirect_uris {grant_type} ile boş olamaz

source: You must set OIDC_RSA_PRIVATE_KEY to use RSA algorithm
tr: RSA algoritmasını kullanmak için OIDC_RSA_PRIVATE_KEY ayarlanmalıdır

source: You cannot use HS256 with public grants or clients
tr: HS256'yı herkese açık izinler veya istemcilerle kullanamazsınız

source: Authorized
tr: Yetkilendirildi

source: Authorization pending
tr: Yetkilendirme bekleniyor

source: Expired
tr: Süresi dolmuş

source: Denied
tr: Reddedildi

source: The access token is invalid.
tr: Geçersiz erişim belirteci.

source: The access token has expired.
tr: Erişim belirteci süresi dolmuş.

source: The access token is valid but does not have enough scope.
tr: Erişim belirteci geçerli ancak yeterli kapsamı yok.

source: Are you sure to delete the application
tr: Uygulamayı silmek istediğinize emin misiniz
zh_hans: 确定删除此应用

source: Cancel
tr: İptal
zh_hans: 取消

source: Delete
tr: Sil
zh_hans: 删除

source: Client id
tr: İstemci kimliği
zh_hans: 客户端ID

source: Client secret
tr: İstemci gizli anahtarı
zh_hans: 客户端密码

source: Hash client secret
tr: İstemci gizli anahtarını hashle

source: yes,no
tr: evet,hayır

source: Client type
tr: İstemci türü
zh_hans: 客户端类型

source: Authorization Grant Type
tr: Yetkilendirme İzni Türü
zh_hans: 授权类型

source: Redirect Uris
tr: Yönlendirme URI'leri
zh_hans: 重定向用户至

source: Post Logout Redirect Uris
tr: Oturum Kapatma Yönlendirme URI'leri

source: Allowed Origins
tr: İzin Verilen Orijinler

source: Go Back
tr: Geri Dön
zh_hans: 返回

source: Edit
tr: Düzenle
zh_hans: 编辑

source: Edit application
tr: Uygulamayı düzenle
zh_hans: 应用/软件

source: Save
tr: Kaydet

source: Your applications
tr: Uygulamalarınız
zh_hans: 您在%s的订单

source: New Application
tr: Yeni Uygulama

source: No applications defined
tr: Tanımlı uygulama yok
zh_hans: 未定义

source: Click here
tr: Buraya tıklayın
zh_hans: 点这里

source: if you want to register a new one
tr: eğer yeni bir tane kaydetmek istiyorsanız
zh_hans: 注册新用户

source: Register a new application
tr: Yeni bir uygulama kaydet
zh_hans: 注册新应用

source: Authorize
tr: Yetkilendir
zh_hans: 授权

source: Application requires the following permissions
tr: Uygulama aşağıdaki izinleri gerektirir

source: Are you sure you want to delete this token?
tr: Bu tokeni silmek istediğinize emin misiniz?
zh_hans: 您确定要删除这个会话吗？

source: Tokens
tr: Tokenler
zh_hans: 会话

source: revoke
tr: iptal et

source: There are no authorized tokens yet.
tr: Henüz yetkilendirilmiş token yok.
zh_hans: 没有已认证会话.

source: Client ID
zh_hans: 客户端ID

source: Redirect uris
zh_hans: 重定向URI

source: Name
zh_hans: 名称

source: Skip authorization
zh_hans: 跳过用户认证

source: Redirect_uris could not be empty with {grant_type} grant_type
zh_hans: Redirect_uris 不能空与 {grant_type} grant_type

source: Application requires following permissions
zh_hans: 应用将获得如下授权

source: Enter a valid URL.
zh_hans: 请输入正确的URL.
